# STLExportOptions Class (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
STLExportOptions Class
Members See Also
---
The export options used by exporting STL format file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public class STLExportOptions : ATFBaseExportOptions
```

Visual Basic
---
```text
Public Class STLExportOptions _
	Inherits ATFBaseExportOptions
```

Visual C++
---
```text
public ref class STLExportOptions : public ATFBaseExportOptions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ATFBaseExportOptions Autodesk.Revit.DB..::..STLExportOptions
# See Also
STLExportOptions Members
Autodesk.Revit.DB Namespace